// @(h)TestMethodAttribute.cs ver 0.00 ( '22.04.22 Nov-Lab ) 作成開始
// @(h)TestMethodAttribute.cs ver 0.51 ( '22.04.22 Nov-Lab ) ベータ版完成
// @(h)TestMethodAttribute.cs ver 0.51a( '22.05.14 Nov-Lab ) 微修正  ：AutoTestMethodAttribute にコンストラクターを追加した
// @(h)TestMethodAttribute.cs ver 0.51b( '22.05.19 Nov-Lab ) その他  ：クラスの派生構造を整理した。機能変更なし。
// @(h)TestMethodAttribute.cs ver 0.62 ( '24.01.20 Nov-Lab ) 仕変対応：AutoTest クラスの仕様変更に対応するため、ロジックを変更した。機能変更なし。
// @(h)TestMethodAttribute.cs ver 0.63 ( '24.01.21 Nov-Lab ) 機能変更：デリゲート規約適合チェックやテスト用メソッド呼び出しはBaseTestMethodInfo側で行うようにした。
// @(h)TestMethodAttribute.cs ver 0.64 ( '24.01.21 Nov-Lab ) 機能追加：種類ごとにソートできるようにテスト用メソッド種別を追加した。
// @(h)TestMethodAttribute.cs ver 0.64a( '24.05.12 Nov-Lab ) その他  ：コメント整理

// @(s)
// 　【テスト用メソッド属性】メソッドをテスト用メソッドとしてマークし、テスト用プロジェクトが自動的に認識できるようにします。

using System;
using System.Diagnostics;
using System.Reflection;
using System.Collections.Generic;


namespace NovLab.DebugSupport
{
    //====================================================================================================
    /// <summary>
    /// 【テスト用メソッド種別】テスト用メソッドの種類を示します。内部整数値は種類ごとのソート順に利用します。
    /// </summary>
    //====================================================================================================
    public enum TestMethodKind
    {
        /// <summary>【手動テスト用メソッド】</summary>
        Manual = 0,

        /// <summary>【自動テスト用メソッド】</summary>
        Auto,
    }


    //====================================================================================================
    /// <summary>
    /// 【テスト用メソッド属性基本部】メソッドをテスト用メソッドとしてマークし、テスト用プロジェクトが自動的に認識できるようにします。
    /// </summary>
    /// <remarks>
    /// 補足<br></br>
    /// ・DEBUGビルドでのみ有効な属性です。<br></br>
    /// ・派生クラスで共通の定義を提供するための抽象基底クラスです。<br></br>
    /// </remarks>
    //====================================================================================================
    [Conditional("DEBUG")]                      // DEBUG ビルドでのみ有効
    [AttributeUsage(AttributeTargets.Method)]   // 属性適用対象 = メソッド
    public abstract class BaseTestMethodAttribute : Attribute
    {
        //====================================================================================================
        // 公開フィールド
        //====================================================================================================
        /// <summary>
        /// 【表示名(読み取り専用)】テスト用メソッドの表示名です。[null = 未指定]
        /// </summary>
        public readonly string displayText;


        //====================================================================================================
        // コンストラクター・公開プロパティー
        //====================================================================================================
        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【テスト用メソッド属性】メソッドをテスト用メソッドとしてマークし、テスト用プロジェクトが自動的に認識できるようにします。
        /// </summary>
        /// <param name="displayText">[in ]：表示名[null = 未指定]</param>
        //--------------------------------------------------------------------------------
        public BaseTestMethodAttribute(string displayText = null)
        {
            this.displayText = displayText;
        }

        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【テスト用メソッド種別(読み取り専用)】テスト用メソッドの種類を示します。
        /// </summary>
        /// <returns>
        /// テスト用メソッド種別
        /// </returns>
        //--------------------------------------------------------------------------------
        public abstract TestMethodKind Kind { get; }
    }


    //====================================================================================================
    /// <summary>
    /// 【手動テスト用メソッド属性】メソッドを手動テスト用メソッドとしてマークし、テスト用プロジェクトが自動的に認識できるようにします。
    /// </summary>
    /// <remarks>
    /// 補足<br></br>
    /// ・DEBUGビルドでのみ有効な属性です。<br></br>
    /// ・手動テスト用メソッドは、テスト結果の目視確認が必要なテストです。
    ///   メソッドのテストを行い、デバッグ出力や画面表示の内容を目視確認します。<br></br>
    /// </remarks>
    //====================================================================================================
    [Conditional("DEBUG")]                      // DEBUG ビルドでのみ有効
    [AttributeUsage(AttributeTargets.Method)]   // 属性適用対象 = メソッド
    public class ManualTestMethodAttribute : BaseTestMethodAttribute
    {
        //====================================================================================================
        // コンストラクター・公開プロパティー
        //====================================================================================================
        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【手動テスト用メソッド属性】メソッドを手動テスト用メソッドとしてマークし、テスト用プロジェクトが自動的に認識できるようにします。
        /// </summary>
        /// <param name="displayText">[in ]：表示名[null = 未指定]</param>
        //--------------------------------------------------------------------------------
        public ManualTestMethodAttribute(string displayText = null) : base(displayText) { }


        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【テスト用メソッド種別(読み取り専用)】テスト用メソッドの種類を示します。
        /// </summary>
        /// <returns>
        /// 常に「手動テスト用メソッド」を返します
        /// </returns>
        //--------------------------------------------------------------------------------
        public override TestMethodKind Kind => TestMethodKind.Manual;
    }


    //====================================================================================================
    /// <summary>
    /// 【自動テスト用メソッド属性】メソッドを自動テスト用メソッドとしてマークし、テスト用プロジェクトが自動的に認識できるようにします。
    /// </summary>
    /// <remarks>
    /// 補足<br></br>
    /// ・DEBUGビルドでのみ有効な属性です。<br></br>
    /// ・自動テスト用メソッドは、テスト結果を自動的にチェックするテストです。
    ///   メソッドのテストを行い、テスト内容をデバッグ出力し、テスト結果を自動的にチェックしてリスナーI/Fに通知します。<br></br>
    /// </remarks>
    //====================================================================================================
    [Conditional("DEBUG")]                      // DEBUG ビルドでのみ有効
    [AttributeUsage(AttributeTargets.Method)]   // 属性適用対象 = メソッド
    public class AutoTestMethodAttribute : BaseTestMethodAttribute
    {
        //====================================================================================================
        // コンストラクター・公開プロパティー
        //====================================================================================================

        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【自動テスト用メソッド属性】メソッドを自動テスト用メソッドとしてマークし、テスト用プロジェクトが自動的に認識できるようにします。
        /// </summary>
        /// <param name="displayText">[in ]：表示名[null = 未指定]</param>
        //--------------------------------------------------------------------------------
        public AutoTestMethodAttribute(string displayText = null) : base(displayText) { }


        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【テスト用メソッド種別(読み取り専用)】テスト用メソッドの種類を示します。
        /// </summary>
        /// <returns>
        /// 常に「自動テスト用メソッド」を返します
        /// </returns>
        //--------------------------------------------------------------------------------
        public override TestMethodKind Kind => TestMethodKind.Auto;

    } // class

} // namespace
