// @(h)AppBase_Test_NovLab.cs ver 0.00 ( '24.01.25 Nov-Lab ) 作成開始
// @(h)AppBase_Test_NovLab.cs ver 0.01 ( '24.01.25 Nov-Lab ) 機能追加：TestFormShowMethodAttribute を追加した。

// @(s)
// 　【アプリケーション基本部】Test for NovLab の基本部分や共通部分を管理します。


using System;
using System.Diagnostics;
using System.Collections.Generic;


namespace Test_NovLab
{
    //====================================================================================================
    /// <summary>
    /// 【テスト用フォーム表示メソッド属性】
    /// メソッドをテスト用フォーム表示用メソッドとしてマークし、テスト用メイン画面が自動的に認識できるようにします。
    /// </summary>
    //====================================================================================================
    [AttributeUsage(AttributeTargets.Method)]   // 属性適用対象 = メソッド
    public class TestFormShowMethodAttribute : Attribute
    {
        //====================================================================================================
        // 公開フィールド
        //====================================================================================================
        /// <summary>
        /// 【表示名(読み取り専用)】テスト用フォームの表示名です。[null = 未指定]
        /// </summary>
        public readonly string displayText;


        //====================================================================================================
        // コンストラクター・公開プロパティー
        //====================================================================================================
        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【テスト用フォーム表示メソッド属性】
        /// メソッドをテスト用フォーム表示用メソッドとしてマークし、テスト用メイン画面が自動的に認識できるようにします。
        /// </summary>
        /// <param name="displayText">[in ]：表示名[null = 未指定]</param>
        //--------------------------------------------------------------------------------
        public TestFormShowMethodAttribute(string displayText = null)
        {
            this.displayText = displayText;
        }

    } // class

} // namespace
